# SETUP CONFIG

In [5]:
import pandas as pd
import sqlite3
from datetime import datetime

# CH-01

## CREATE DATABASE AND TABLES

In [7]:
# Connect to SQLite database (creates it if it doesn't exist)
conn = sqlite3.connect('sqlc.db')
cursor = conn.cursor()

# Create the EMPLOYEE table
cursor.execute('''
CREATE TABLE IF NOT EXISTS EMP (
    EMPNO INTEGER PRIMARY KEY,
    ENAME TEXT NOT NULL,
    JOB TEXT,
    MGR INTEGER,
    HIREDATE DATE,
    SAL REAL,
    COMM REAL,
    DEPTNO INTEGER
)
''')

# Employee data
employees = [
    (7369, 'SMITH', 'CLERK', 7902, '2005-12-17', 800, None, 20),
    (7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-20', 1600, 300, 30),
    (7521, 'WARD', 'SALESMAN', 7698, '2006-02-22', 1250, 500, 30),
    (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975, None, 20),
    (7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1250, 1400, 30),
    (7698, 'BLAKE', 'MANAGER', 7839, '2006-05-01', 2850, None, 30),
    (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450, None, 10),
    (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000, None, 20),
    (7839, 'KING', 'PRESIDENT', None, '2006-11-17', 5000, None, 10),
    (7844, 'TURNER', 'SALESMAN', 7698, '2006-09-08', 1500, 0, 30),
    (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100, None, 20),
    (7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950, None, 30),
    (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000, None, 20),
    (7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300, None, 10)
]

# Insert employee data
cursor.executemany('''
INSERT INTO EMP (EMPNO, ENAME, JOB, MGR, HIREDATE, SAL, COMM, DEPTNO)
VALUES (?, ?, ?, ?, ?, ?, ?, ?)
''', employees)

# Commit the changes
conn.commit()

print("Database 'sqlc.db' created successfully!")
print(f"Inserted {cursor.rowcount} employee records.\n")

# Verify the data by querying all records
cursor.execute('SELECT * FROM EMP ORDER BY EMPNO')
rows = cursor.fetchall()

print("Employee Data:")
print("-" * 90)
print(f"{'EMPNO':<8} {'ENAME':<10} {'JOB':<12} {'MGR':<8} {'HIREDATE':<12} {'SAL':<8} {'COMM':<8} {'DEPTNO':<8}")
print("-" * 90)

for row in rows:
    empno, ename, job, mgr, hiredate, sal, comm, deptno = row
    mgr_str = str(mgr) if mgr else ''
    comm_str = str(int(comm)) if comm is not None else ''
    print(f"{empno:<8} {ename:<10} {job:<12} {mgr_str:<8} {hiredate:<12} {int(sal):<8} {comm_str:<8} {deptno:<8}")

print("-" * 90)
print(f"\nTotal employees: {len(rows)}")

# Close the connection
conn.close()

Database 'sqlc.db' created successfully!
Inserted 14 employee records.

Employee Data:
------------------------------------------------------------------------------------------
EMPNO    ENAME      JOB          MGR      HIREDATE     SAL      COMM     DEPTNO
------------------------------------------------------------------------------------------
7369     SMITH      CLERK        7902     2005-12-17   800               20
7499     ALLEN      SALESMAN     7698     2006-02-20   1600     300      30
7521     WARD       SALESMAN     7698     2006-02-22   1250     500      30
7566     JONES      MANAGER      7839     2006-04-02   2975              20
7654     MARTIN     SALESMAN     7698     2006-09-28   1250     1400     30
7698     BLAKE      MANAGER      7839     2006-05-01   2850              30
7782     CLARK      MANAGER      7839     2006-06-09   2450              10
7788     SCOTT      ANALYST      7566     2007-12-09   3000              20
7839     KING       PRESIDENT             2006-11-17   5000              10
7844     TURNER     SALESMAN     7698     2006-09-08   1500     0        30
7876     ADAMS      CLERK        7788     2008-01-12   1100              20
7900     JAMES      CLERK        7698     2006-12-03   950               30
7902     FORD       ANALYST      7566     2006-12-03   3000              20
7934     MILLER     CLERK        7782     2007-01-23   1300              10
------------------------------------------------------------------------------------------

Total employees: 14

In [8]:
# Connect to the existing SQLite database
conn = sqlite3.connect('sqlc.db')
cursor = conn.cursor()

# Create the DEPT table
cursor.execute('''
CREATE TABLE IF NOT EXISTS DEPT (
    DEPTNO INTEGER PRIMARY KEY,
    DNAME TEXT NOT NULL,
    LOC TEXT
)
''')

# Department data
departments = [
    (10, 'ACCOUNTING', 'NEW YORK'),
    (20, 'RESEARCH', 'DALLAS'),
    (30, 'SALES', 'CHICAGO'),
    (40, 'OPERATIONS', 'BOSTON')
]

# Insert department data
cursor.executemany('''
INSERT INTO DEPT (DEPTNO, DNAME, LOC)
VALUES (?, ?, ?)
''', departments)

# Commit the changes
conn.commit()

print("DEPT table created successfully in 'sqlc.db'!")
print(f"Inserted {len(departments)} department records.\n")

# Verify the data by querying all records
cursor.execute('SELECT * FROM DEPT ORDER BY DEPTNO')
rows = cursor.fetchall()

print("Department Data:")
print("-" * 50)
print(f"{'DEPTNO':<10} {'DNAME':<20} {'LOC':<15}")
print("-" * 50)

for row in rows:
    deptno, dname, loc = row
    print(f"{deptno:<10} {dname:<20} {loc:<15}")

print("-" * 50)
print(f"\nTotal departments: {len(rows)}\n")

# Show all tables in the database
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' ORDER BY name")
tables = cursor.fetchall()
print("Tables in database:")
for table in tables:
    print(f"  - {table[0]}")

# Close the connection
conn.close()

DEPT table created successfully in 'sqlc.db'!
Inserted 4 department records.

Department Data:
--------------------------------------------------
DEPTNO     DNAME                LOC
--------------------------------------------------
10         ACCOUNTING           NEW YORK
20         RESEARCH             DALLAS
30         SALES                CHICAGO
40         OPERATIONS           BOSTON
--------------------------------------------------

Total departments: 4

Tables in database:
  - DEPT
  - EMP

In [9]:
# Connect to the existing SQLite database
conn = sqlite3.connect('sqlc.db')

In [ ]:
# 1.1 Retrieving All Rows and Columns from a Table

df = pd.read_sql_query("select * from emp", conn)
print(df)

Shape: (14, 8)
    EMPNO   ENAME        JOB     MGR    HIREDATE     SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0  2005-12-17   800.0     NaN      20
1    7499   ALLEN   SALESMAN  7698.0  2006-02-20  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0  2006-02-22  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0  2006-04-02  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0  2006-09-28  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0  2006-05-01  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0  2006-06-09  2450.0     NaN      10
7    7788   SCOTT    ANALYST  7566.0  2007-12-09  3000.0     NaN      20
8    7839    KING  PRESIDENT     NaN  2006-11-17  5000.0     NaN      10
9    7844  TURNER   SALESMAN  7698.0  2006-09-08  1500.0     0.0      30
10   7876   ADAMS      CLERK  7788.0  2008-01-12  1100.0     NaN      20
11   7900   JAMES      CLERK  7698.0  2006-12-03   950.0     NaN      30
12   7902    FORD    ANALYST  7566.0  2006-12-03  3000.0     NaN      20
13   7934  MILLER      CLERK  7782.0  2007-01-23  1300.0     NaN      10

In [ ]:
df = pd.read_sql_query("select empno,ename,job,sal,mgr,hiredate,comm,deptno \
                        from emp", conn)
print(df)

Shape: (14, 8)
    EMPNO   ENAME        JOB     SAL     MGR    HIREDATE    COMM  DEPTNO
0    7369   SMITH      CLERK   800.0  7902.0  2005-12-17     NaN      20
1    7499   ALLEN   SALESMAN  1600.0  7698.0  2006-02-20   300.0      30
2    7521    WARD   SALESMAN  1250.0  7698.0  2006-02-22   500.0      30
3    7566   JONES    MANAGER  2975.0  7839.0  2006-04-02     NaN      20
4    7654  MARTIN   SALESMAN  1250.0  7698.0  2006-09-28  1400.0      30
5    7698   BLAKE    MANAGER  2850.0  7839.0  2006-05-01     NaN      30
6    7782   CLARK    MANAGER  2450.0  7839.0  2006-06-09     NaN      10
7    7788   SCOTT    ANALYST  3000.0  7566.0  2007-12-09     NaN      20
8    7839    KING  PRESIDENT  5000.0     NaN  2006-11-17     NaN      10
9    7844  TURNER   SALESMAN  1500.0  7698.0  2006-09-08     0.0      30
10   7876   ADAMS      CLERK  1100.0  7788.0  2008-01-12     NaN      20
11   7900   JAMES      CLERK   950.0  7698.0  2006-12-03     NaN      30
12   7902    FORD    ANALYST  3000.0  7566.0  2006-12-03     NaN      20
13   7934  MILLER      CLERK  1300.0  7782.0  2007-01-23     NaN      10

In [ ]:
df = pd.read_sql_query("select * \
                        from emp \
                        where deptno = 10", conn)
print(df)

Shape: (3, 8)
   EMPNO   ENAME        JOB     MGR    HIREDATE     SAL  COMM  DEPTNO
0   7782   CLARK    MANAGER  7839.0  2006-06-09  2450.0  None      10
1   7839    KING  PRESIDENT     NaN  2006-11-17  5000.0  None      10
2   7934  MILLER      CLERK  7782.0  2007-01-23  1300.0  None      10